Revit 2027 API
ViewFamilyType.ViewFamily Property
 The ViewFamily for this view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewFamily ViewFamily { get; }
Public ReadOnly Property ViewFamily As ViewFamily
	Get
public:
property ViewFamily ViewFamily {
	ViewFamily get ();
}
member ViewFamily : ViewFamily with get
Property Value
ViewFamily
Example
public ViewFamily GetViewFamily(Document doc, View view)
{
    ViewFamily viewFamily = ViewFamily.Invalid;
    ElementId viewTypeId = view.GetTypeId();
    ElementId viewTypeIdOne = new ElementId(1L);
    if (viewTypeId > viewTypeIdOne) // some views may not have a ViewFamilyType
    {
        ViewFamilyType viewFamilyType = doc.GetElement(viewTypeId) as ViewFamilyType;
        viewFamily = viewFamilyType.ViewFamily;
    }
    return viewFamily;
}
See Also
Reference
ViewFamilyType Class
Autodesk.Revit.DB Namespace